//// This file contains an 'Intel Peripheral Driver' and is// licensed for Intel CPUs and chipsets under the terms of your// license agreement with Intel or your vendor.  This file may// be modified by the user, subject to additional terms of the// license agreement//// *++//// Copyright (c) 1999 - 2016 Intel Corporation. All rights reserved// This software and associated documentation (if any) is furnished// under a license and may only be used or copied in accordance// with the terms of the license. Except as permitted by such// license, no part of this software or documentation may be// reproduced, stored in a retrieval system, or transmitted in any// form or by any means without the express written consent of// Intel Corporation.////// Module Name:////   NorthBridgeStrings.uni//// Abstract:////   String definitions for North Bridge Configuration form.//// Revision History://// --*//=##langdef   en-US "English"#string STR_EMPTY_STRING            #language en-US  ""#string STR_AUTO_STRING             #language en-US  "Auto"#string STR_FORCE_STRING            #language en-US  "Force"#string STR_ENABLED_STRING          #language en-US  "Enabled"#string STR_DISABLED_STRING         #language en-US  "Disabled"#string STR_MANUAL_STRING           #language en-US  "Manual"#string STR_NORMAL_STRING           #language en-US  "Normal"#string STR_INMEDIATE_STRING        #language en-US  "Inmediate"#string STR_NONE_STRING             #language en-US  "None"#string STR_TBD_STRING              #language en-US  "TBD"#string STR_HALT_STRING             #language en-US  "Halt"#string STR_CONTINUE_STRING         #language en-US  "Continue"#string STR_DEFAULT                 #language en-US  " Default "#string STR_VALUE_1N_STRING          #language en-US " 1N "#string STR_VALUE_2N_STRING          #language en-US " 2N "#string STR_VALUE_1_STRING          #language en-US " 1 "#string STR_VALUE_2_STRING          #language en-US " 2 "#string STR_VALUE_3_STRING          #language en-US " 3 "#string STR_VALUE_4_STRING          #language en-US " 4 "#string STR_VALUE_5_STRING          #language en-US " 5 "#string STR_VALUE_6_STRING          #language en-US " 6 "#string STR_VALUE_7_STRING          #language en-US " 7 "#string STR_VALUE_8_STRING          #language en-US " 8 "#string STR_VALUE_9_STRING          #language en-US " 9 "#string STR_VALUE_10_STRING         #language en-US " 10 "#string STR_VALUE_11_STRING         #language en-US " 11 "#string STR_VALUE_12_STRING         #language en-US " 12 "#string STR_VALUE_13_STRING         #language en-US " 13 "#string STR_VALUE_14_STRING         #language en-US " 14 "#string STR_VALUE_15_STRING         #language en-US " 15 "#string STR_VALUE_16_STRING         #language en-US " 16 "#string STR_VALUE_17_STRING         #language en-US " 17 "#string STR_VALUE_18_STRING         #language en-US " 18 "#string STR_VALUE_19_STRING         #language en-US " 19 "#string STR_VALUE_20_STRING         #language en-US " 20 "#string STR_VALUE_21_STRING         #language en-US " 21 "#string STR_VALUE_22_STRING         #language en-US " 22 "#string STR_VALUE_23_STRING         #language en-US " 23 "#string STR_VALUE_24_STRING         #language en-US " 24 "#string STR_VALUE_25_STRING         #language en-US " 25 "#string STR_VALUE_26_STRING         #language en-US " 26 "#string STR_VALUE_27_STRING         #language en-US " 27 "#string STR_VALUE_28_STRING         #language en-US " 28 "#string STR_VALUE_29_STRING         #language en-US " 29 "#string STR_VALUE_30_STRING         #language en-US " 30 "#string STR_VALUE_31_STRING         #language en-US " 31 "#string STR_VALUE_32_STRING         #language en-US " 32 "#string STR_VALUE_33_STRING         #language en-US " 33 "#string STR_VALUE_34_STRING         #language en-US " 34 "#string STR_VALUE_35_STRING         #language en-US " 35 "#string STR_VALUE_36_STRING         #language en-US " 36 "#string STR_VALUE_37_STRING         #language en-US " 37 "#string STR_VALUE_38_STRING         #language en-US " 38 "#string STR_VALUE_39_STRING         #language en-US " 39 "#string STR_VALUE_40_STRING         #language en-US " 40 "#string STR_VALUE_41_STRING         #language en-US " 41 "#string STR_VALUE_42_STRING         #language en-US " 42 "#string STR_VALUE_43_STRING         #language en-US " 43 "#string STR_VALUE_44_STRING         #language en-US " 44 "#string STR_VALUE_50_STRING         #language en-US " 50 "#string STR_VALUE_75_STRING         #language en-US " 75 "#string STR_VALUE_100_STRING        #language en-US " 100 "#string STR_VALUE_2048_STRING       #language en-US " 2048 "#string STR_VALUE_4096_STRING       #language en-US " 4096 "#string STR_VALUE_8192_STRING       #language en-US " 8192 "#string STR_VALUE_16384_STRING      #language en-US " 16384 "#string STR_BYTE0_STRING            #language en-US " Byte 0 "#string STR_BYTE7_STRING            #language en-US " Byte 7 "#string STR_PPR_OPTION0_TITLE       #language en-US "PPR Option 0"#string STR_PPR_OPTION1_TITLE       #language en-US "PPR Option 1"#string STR_PPR_OPTION2_TITLE       #language en-US "PPR Option 2"#string STR_PPR_OPTION3_TITLE       #language en-US "PPR Option 3"#string STR_PPR_OPTION4_TITLE       #language en-US "PPR Option 4"#string STR_PPR_OPTION5_TITLE       #language en-US "PPR Option 5"#string STR_PPR_OPTION6_TITLE       #language en-US "PPR Option 6"#string STR_PPR_OPTION7_TITLE       #language en-US "PPR Option 7"#string STR_PPR_OPTION_HELP         #language en-US "Configuration of PPR Option"#string STR_PPR_ENABLE_TITLE        #language en-US "PPR Sequence"#string STR_PPR_ENABLE_HELP         #language en-US "Enables/Disables the PPR Sequence"#string STR_PPR_ROW_TITLE           #language en-US "Target Row"#string STR_PPR_ROW_HELP            #language en-US "Selects the failure row"#string STR_PPR_BANK_TITLE          #language en-US "Target Bank"#string STR_PPR_BANK_HELP           #language en-US "Selects the failure bank"#string STR_PPR_BANKG_TITLE         #language en-US "Target Bank Group"#string STR_PPR_BANKG_HELP          #language en-US "Selects the failure bank group"#string STR_PPR_DRAM_TITLE          #language en-US "Target Dram Device"#string STR_PPR_DRAM_HELP           #language en-US "Selects the failure DRAM device for max device is 7 and for x4 is 16"#string STR_PPR_RANK_TITLE          #language en-US "Target Rank"#string STR_PPR_RANK_HELP           #language en-US "Selects the failure rank"#string STR_PPR_CHANNEL_TITLE       #language en-US "Target Channel"#string STR_PPR_CHANNEL_HELP        #language en-US "Selects the failure channel"#string STR_NB_FORM                     #language en-US "North Bridge Chipset Configuration"#string STR_NB_FORM_HELP                #language en-US "North Bridge Parameters"#string STR_MEMORY                      #language en-US "Memory Information"#string STR_MRC_VERSION_NAME            #language en-US "MRC Version"#string STR_MRC_VERSION_VALUE           #language en-US "N/A" // Dynamically updated#string STR_MRC_VERSION_HELP            #language en-US "MRC Version:       Major Revision . Minor Revision . Release Candidate Number . Internal Revision Number"#string STR_MEMORY_SIZE_NAME            #language en-US "Total Memory"#string STR_MEMORY_SIZE_VALUE           #language en-US "N/A" // Dynamically updated#string STR_MEMORY_SIZE_HELP            #language en-US "Total Memory in the System."#string STR_MEMORY_SIZE_SLOT_HELP       #language en-US "Memory in the Slot."// LoopCount for CPGC#string STR_LOOPCOUNT_CPGC_PROMPT       #language en-US "LoopCount"#string STR_LOOPCOUNT_CPGC_HELP         #language en-US "Number of time CPGC will be tested 1 - 65535"#string STR_BUNIT_PERFORMANCE_PROMPT    #language en-US "Bunit Performance"#string STR_BUNIT_PERFORMANCE_HELP      #language en-US "Enables/Disables the Bunit Performance Settings"#string STR_ERR_THRESHOLD_SUPPORT       #language en-US "Error Threshold"#string STR_ERR_THRESHOLD_HELP          #language en-US "Modify the MCI Error threshold from 1-> 32768"#string STR_INTERLEAVE_MODE_PROMPT      #language en-US "Interleave Mode"#string STR_INTERLEAVE_MODE_HELP        #language en-US "Selects the Interleave Mode Settings"#string STR_MODE0_STRING                #language en-US "Mode 0"#string STR_MODE1_STRING                #language en-US "Mode 1"#string STR_MODE2_STRING                #language en-US "Mode 2"#string STR_HVM_STRING                  #language en-US "HVM Mode"#string STR_CKE_POWER_DOWN_PROMPT       #language en-US "CKE Power Down"#string STR_CKE_POWER_DOWN_HELP         #language en-US "Enables/Disables the CKE Power Down"#string STR_ACTIVEPWRDWN_STRING       #language en-US "Active Power Down"#string STR_PRECHARGE_STRING          #language en-US "Precharge Power Down"#string STR_SMM_SIZE                    #language en-US "Smm Size (MB)"#string STR_SMM_SIZE_HELP               #language en-US "Specify the size of the SMM/TSEG region 1 MB aligned"//// Memory frequency//#string STR_MEMORY_FRQ_PROMPT           #language en-US "Memory Frequency"#string STR_MEMORY_FRQ_HELP             #language en-US "DDR memory frequency: DDR4 up to DDR-2666 . DDR3 up to DDR-1867"#string STR_MEMORY_FRQ_VALUE            #language en-US "N/A" // Dynamically updated#string STR_MEMORY_FRQ_DDR3_800         #language en-US "DDR3-800"#string STR_MEMORY_FRQ_DDR3_1066        #language en-US "DDR3-1066"#string STR_MEMORY_FRQ_DDR3_1333        #language en-US "DDR3-1333"#string STR_MEMORY_FRQ_DDR3_1600        #language en-US "DDR3-1600"#string STR_MEMORY_FRQ_DDR3_1866        #language en-US "DDR3-1867"#string STR_MEMORY_FRQ_DDR4_1600        #language en-US "DDR4-1600"#string STR_MEMORY_FRQ_DDR4_1866        #language en-US "DDR4-1867"#string STR_MEMORY_FRQ_DDR4_2133        #language en-US "DDR4-2133"#string STR_MEMORY_FRQ_DDR4_2400        #language en-US "DDR4-2400"#string STR_MEMORY_FRQ_DDR4_2666        #language en-US "DDR4-2666"#string STR_MEMORY_FRQ_DDR_1600        #language en-US "DDR-1600"#string STR_MEMORY_FRQ_DDR_1866        #language en-US "DDR-1867"#string STR_MEMORY_FRQ_DDR_2133        #language en-US "DDR-2133"#string STR_MEMORY_FRQ_DDR_2400        #language en-US "DDR-2400"#string STR_MEMORY_FRQ_DDR_2666        #language en-US "DDR-2666"#string STR_MEMORY_CHANNELS_PROMPT      #language en-US "Memory Channels"#string STR_MEMORY_CHANNELS_HELP        #language en-US "DDR Memory Channels"#string STR_MEMORY_CHANNELS_DUAL        #language en-US "Dual Channel"#string STR_MEMORY_CHANNELS_SINGLE      #language en-US "Single Channel"#string STR_MEMORY_ADD_PARITY_PROMPT    #language en-US "Command Address Parity"#string STR_MEMORY_ADD_PARITY_HELP      #language en-US "DDR4 command address parity"#string STR_MEMORY_ADD_PARITY_DISABLE   #language en-US "Disabled"#string STR_MEMORY_ADD_PARITY_ENABLE    #language en-US "Enabled"#string STR_MRC_DBG_MSG_MIN             #language en-US "Minimum"#string STR_MRC_DBG_MSG_MED             #language en-US "Medium"#string STR_MRC_DBG_MSG_MAX             #language en-US "Maximum"#string STR_32BITMODE_PROMPT            #language en-US "Enable 32 bit bus"#string STR_32BITMODE_TRAINING_HELP     #language en-US "This enables 32 bit bus memory mode"#string STR_TCL_PERF_PROMPT             #language en-US "TCL performance"#string STR_TCL_PERF_HELP               #language en-US "Enable TCL increase for performance"#string STR_TIMING_MRC_PROMPT           #language en-US "Timing Configuration"#string STR_TIMING_MRC_HELP             #language en-US "Configures the timing for the memory"#string STR_PARALLEL_TRAINING_PROMPT    #language en-US "Enable Parallel Training"#string STR_PARALLEL_TRAINING_HELP      #language en-US "Memory Training Algorithms will run in parallel"#string STR_RK2RK_MSG_SUPPORT           #language en-US "Rank-to-Rank"#string STR_RK2RK_MSG_SUPPORT_HELP      #language en-US "Enables/Disables the Rank To Rank Switching"#string STR_READ_PER_BIT_SUPPORT        #language en-US "Read Per Bit Training"#string STR_READ_PER_BIT_SUPPORT_HELP   #language en-US "Enables/Disables the Read Per Bit memory training"#string STR_WRITE_PER_BIT_SUPPORT       #language en-US "Write Per Bit Training"#string STR_WRITE_PER_BIT_SUPPORT_HELP  #language en-US "Enables/Disables the Write Per Bit memory training"//// Pass Gate Options//#string STR_PASS_GATE_PROMPT               #language en-US "Pass Gate Setup"#string STR_PASS_GATE_HELP                 #language en-US "Configure Mitigation Feature and Pass Gate Test"//// Mitigation feature//#string STR_MITIGATION_CONFIG              #language en-US "Mitigation Feature Configuration"#string STR_MITIGATION_EN_PROMPT           #language en-US "Mitigation Feature Enable"#string STR_MITIGATION_EN_HELP             #language en-US "Enables/Disables Mitigation Feature"//// Pass Gate Characterization Test//#string STR_PASS_GATE_TEST                 #language en-US "Pass Gate Stress Test Configuration"#string STR_CHANNEL_0                      #language en-US "Channel 0:"#string STR_CHANNEL_1                      #language en-US "Channel 1:"#string STR_PASS_GATE_TEST_SUPPORT         #language en-US "Pass Gate Test"#string STR_PASS_GATE_TEST_HELP            #language en-US "Enables/Disables the Pass Gate Test"#string STR_PASS_GATE_DIRECTION_SUPPORT    #language en-US "Pass Gate Test Direction"#string STR_PASS_GATE_DIRECTION_HELP       #language en-US "Selects if move through memory from Lowest->Highest or from Highest->Lowest"#string STR_PASS_GATE_REPETITION_SUPPORT   #language en-US "Pass Gate Test Repetition"#string STR_PASS_GATE_REPETITION_HELP      #language en-US "Pass Gate Test Repetition Count Range over the same row (1000x)"#string STR_PASS_GATE_ITERATION_SUPPORT    #language en-US "Pass Gate Test Iterations"#string STR_PASS_GATE_ITERATION_HELP       #language en-US "Pass Gate Test Iterations on Row (repeat the 'Pass Gate Test Repetition')"#string STR_PASS_GATE_SWIZZLE_SUPPORT      #language en-US "Pass Gate Swizzle"#string STR_PASS_GATE_SWIZZLE_HELP         #language en-US "Forces Swizzle mode (for Samsung)"#string STR_PASS_GATE_PATTERN_SUPPORT      #language en-US "Pass Gate Pattern"#string STR_PASS_GATE_PATTERN_HELP         #language en-US "Select between Pattern 1's or 0's Agressor"#string STR_PASS_GATE_TARGET_SUPPORT       #language en-US "Pass Gate Target Pattern"#string STR_PASS_GATE_TARGET_HELP          #language en-US "Select to target pattern 1's or 0's"#string STR_LOW_HIGH_STRING                 #language en-US  "Lowest->Highest"#string STR_HIGH_LOW_STRING                 #language en-US  "Highest->Lowest"#string STR_0_PASS_GATE_STRING              #language en-US  "0's"#string STR_1_PASS_GATE_STRING              #language en-US  "1's"#string STR_PASS_GATE_SPEED_SUPPORT         #language en-US  "Pass Gate Speed"#string STR_PASS_GATE_SPEED_HELP            #language en-US  "Speed of execution of the characterization test"#string STR_1X_ONLY                         #language en-US  "1x Only"#string STR_2X_ONLY                         #language en-US  "2x Only"#string STR_4X_ONLY                         #language en-US  "4x Only"#string STR_8X_ONLY                         #language en-US  "8x Only"#string STR_PASS_GATE_PARTIAL_SUPPORT      #language en-US "Pass Gate Partial"#string STR_PASS_GATE_PARTIAL_HELP         #language en-US "Enables/Disables the Pass Gate Test in an specified memory range"#string STR_PASS_GATE_ROW_BANK_MIN_SUPPORT #language en-US "Row Bank Min"#string STR_PASS_GATE_ROW_BANK_MIN_HELP    #language en-US "Select the minimum address to test. If DDR3 'Row Bank Min[2:0] -> Banks' and 'Row Bank Min[18:3] -> Rows', if DDR4 'Row Bank Min[1:0] -> Banks', 'Row Bank Min[3:2] -> Banks Groups' and 'Row Bank Min[21:4] -> Rows'"#string STR_PASS_GATE_ROW_BANK_MAX_SUPPORT #language en-US "Row Bank Max"#string STR_PASS_GATE_ROW_BANK_MAX_HELP    #language en-US "Select the maximum address to test. If DDR3 'Row Bank Max[2:0] -> Banks' and 'Row Bank Max[18:3] -> Rows', if DDR4 'Row Bank Max[1:0] -> Banks', 'Row Bank Max[3:2] -> Banks Groups' and 'Row Bank Max[21:4] -> Rows'"#string STR_PASS_GATE_MONTECARLO_SUPPORT   #language en-US "Pass Gate MonteCarlo"#string STR_PASS_GATE_MONTECARLO_HELP      #language en-US "Enable/Disable Search Algorithm in order to find PG Max"#string STR_PASS_GATE_MAX_FAILURES_SUPPORT #language en-US "Pass Gate Max Failures"#string STR_PASS_GATE_MAX_FAILURES_HELP    #language en-US "The number of failures before reducing repetition value"#string STR_PASS_GATE_MAX_REPETITION_SUPPORT   #language en-US "Pass Gate Montecarlo Start"#string STR_PASS_GATE_MAX_REPETITION_HELP      #language en-US "The start repetition value for MonteCarlo"#string STR_PASS_GATE_MIN_REPETITION_SUPPORT   #language en-US "Pass Gate Montecarlo Decrement"#string STR_PASS_GATE_MIN_REPETITION_HELP      #language en-US "Step Decrement value"#string STR_PASS_GATE_RANK_0_EN_SUPPORT    #language en-US "Rank 0"#string STR_PASS_GATE_RANK_0_EN_HELP       #language en-US "Allow the Rank 0 to be tested"#string STR_PASS_GATE_RANK_1_EN_SUPPORT    #language en-US "Rank 1"#string STR_PASS_GATE_RANK_1_EN_HELP       #language en-US "Allow the Rank 1 to be tested"#string STR_PASS_GATE_RANK_2_EN_SUPPORT    #language en-US "Rank 2"#string STR_PASS_GATE_RANK_2_EN_HELP       #language en-US "Allow the Rank 2 to be tested"#string STR_PASS_GATE_RANK_3_EN_SUPPORT    #language en-US "Rank 3"#string STR_PASS_GATE_RANK_3_EN_HELP       #language en-US "Allow the Rank 3 to be tested"//// Leaky Bucket Options//#string STR_LEAKY_BUCKET_PROMPT               #language en-US "Leaky Bucket Setup"#string STR_LEAKY_BUCKET_HELP                 #language en-US "Configure Corrected Memory Error Thresholding/Signaling (Leaky Bucket)"#string STR_LEAKY_BUCKET_RATE_UNITS_PROMPT    #language en-US "Leak Rate Units"#string STR_LEAKY_BUCKET_RATE_UNITS_HELP      #language en-US "Configure Leak Rate Units for programming all Ranks"#string STR_USEC_STRING                       #language en-US "Microseconds"#string STR_DAYS_STRING                       #language en-US "Days"#string STR_CORR_ERR_THR_CONFIG               #language en-US "Correctable Error Threshold"#string STR_LEAK_RATE_CONFIG                  #language en-US "Leak Rate Configuration"#string STR_DRAM_RAPL_LIMIT_LOCK              #language en-US "LOCK MSR 618 DDR_RAPL_LIMIT"#string STR_DRAM_RAPL_LIMIT_LOCK_HELP         #language en-US "Allows user to lock the corresponding MSRs by setting the lock bit"#ifdef NONVOLATILE_MEM_EN//// NonVolatile Memory//#string STR_NV_MEM_PROMPT              #language en-US "NonVolatile Memory Setup"#string STR_NV_MEM_HELP                #language en-US "Setup to maintain memory data through a power loss"#string STR_NV_MEM_METHOD_PROMPT       #language en-US "Method"#string STR_NV_MEM_METHOD_HELP         #language en-US "Select how data will be saved after power loss"#string STR_NV_MEM_ADR                 #language en-US "ADR+BBU"#string STR_NV_MEM_C2F                 #language en-US "ADR+C2F"#string STR_NV_MEM_NVDIMM              #language en-US "NVDIMM"#string STR_NV_MEM_SMI_C2F             #language en-US "SMI+C2F"#string STR_NV_MEM_FLUSHING_PROMPT     #language en-US "Cache Flushing"#string STR_NV_MEM_FLUSHING_HELP       #language en-US "Select the amount of cache that should be flushed"#string STR_NV_MEM_FLUSHING_L1_STRING  #language en-US "MemCtrlr only"#string STR_NV_MEM_FLUSHING_L2_STRING  #language en-US "L1, L2 and MemCtrlr"#string STR_NV_MEM_EVENT_SRC_PROMPT      #language en-US "ADR State source"#string STR_NV_MEM_EVENT_SRC_HELP        #language en-US "Selects whether ADR State source is internal or external"#string STR_NV_MEM_EVENT_INTERNAL_STRING #language en-US "internal"#string STR_NV_MEM_EVENT_EXTERNAL_STRING #language en-US "external"#string STR_NV_MEM_INTERLEAVE_PROMPT   #language en-US "Interleaving"#string STR_NV_MEM_INTERLEAVE_HELP     #language en-US "interleaved or separate NVDIMMs address space"#string STR_NV_MEM_ERASE_ARM_PROMPT    #language en-US "Erase & Arm"#string STR_NV_MEM_ERASE_ARM_HELP      #language en-US "Enable erasing and arming of NVDIMM after data recovery"#string STR_NV_MEM_RESTORE_PROMPT      #language en-US "Restore"#string STR_NV_MEM_RESTORE_HELP        #language en-US "Enable restoring of data from the NVDIMMs"#string STR_NV_MEM_NV_BATT_TITLE       #language en-US "NVDIMM battery"#string STR_NV_MEM_NV_BATT_HELP        #language en-US "NVDIMM not available until adequate charge is available"#string STR_NV_MEM_NV_BATT_VALUE       #language en-US "inactive - charging" // Dynamically updated#string STR_NV_LBA_LOCATION_METHOD     #language en-US "LBA Start Location"#string STR_NV_LBA_LOC_METHOD_HELP     #language en-US "The method used to determine the C2F storage space"#string STR_NV_LBA_LOC_FIXED           #language en-US "Fixed LBA"#string STR_NV_LBA_LOC_PART            #language en-US "C2F disk Partition"#string STR_NV_LBA_PROMPT              #language en-US "LBA"#string STR_NV_LBA_HELP                #language en-US "the starting LBA where C2F data will be saved"#string STR_NV_MEM_SIZE_PROMPT         #language en-US "Size(MB)"#string STR_NV_MEM_SIZE_HELP           #language en-US "the amount (in megabytes) from the top of memory space to be saved, limited to memory space above 4gig"#string STR_NV_MEM_TEST_PROMPT         #language en-US "Test NonVol mode:"#string STR_NV_MEM_TEST_HELP           #language en-US "force a NonVolatile memory flow"#string STR_NV_MEM_ADR_RECOVERY_STRING #language en-US "ADR recovery"#string STR_NV_MEM_C2F_SAVE_STRING     #language en-US "ADR-C2F save"#string STR_NV_MEM_C2F_RESTORE_STRING  #language en-US "ADR-C2F restore"#string STR_NV_MEM_IADR_PROMPT         #language en-US "Internal Pwr Loss Event Setup"#string STR_NV_MEM_IADR_HELP           #language en-US "Selection of the internal sources that can initiate a data save before power down or reset"#string STR_IADR_ENABLE_PROMPT         #language en-US "SoC Pwr loss support"#string STR_IADR_ENABLE_HELP           #language en-US "enable internal detection of ADR entry instead of a CPLD"#string STR_IADR_PMC_PROMPT             #language en-US "PMC reset"#string STR_IADR_PMC_HELP              #language en-US "Notify when global reset because of SMBUS Slave pwr down; CF9 w/global reset; Host partition timeout w/Promote to global reset; Sx entry timeout"#string STR_IADR_PBO_PROMPT            #language en-US "Power Button Override"#string STR_IADR_PBO_HELP              #language en-US "Notify when Power Button Override"#string STR_IADR_MPBO_PROMPT           #language en-US "ME Pwr Button Override"#string STR_IADR_MPBO_HELP             #language en-US "Notify when ME initiated Power Button Override"#string STR_IADR_MWDT_PROMPT           #language en-US "ME WDT"#string STR_IADR_MWDT_HELP             #language en-US "Notify when ME watchdog timer expire"#string STR_IADR_MRST_PROMPT           #language en-US "ME reset"#string STR_IADR_MRST_HELP             #language en-US "Notify when ME initiated global reset"#string STR_IADR_PWDT_PROMPT           #language en-US "PMC WDT"#string STR_IADR_PWDT_HELP             #language en-US "Notify when PMC watchdog timer expire"#string STR_IADR_MUE_PROMPT            #language en-US "ME uncorr Error"#string STR_IADR_MUE_HELP              #language en-US "Notify when ME uncorrectable error"#string STR_IADR_POK_PROMPT            #language en-US "SYS_PWROK"#string STR_IADR_POK_HELP              #language en-US "Notify when SYS_PWROK failure"#string STR_IADR_PPERR_PROMPT          #language en-US "PMC parity error"#string STR_IADR_PPERR_HELP            #language en-US "Notify when PMC parity error"#string STR_IADR_RESET_PROMPT          #language en-US "Return power"#string STR_IADR_RESET_HELP            #language en-US "Power up ~4 sec after ADR entry"#endif //NONVOLATILE_MEM_EN//// Memory Timing//#string STR_TCL_TIMING_PROMPT_CH0       #language en-US "tCL  Channel 0: "#string STR_TCL_TIMING_HELP_CH0         #language en-US "Shows tCL configuration in channel 0"#string STR_TCL_TIMING_VALUE_CH0        #language en-US "N/A" // Dynamically updated#string STR_TRCD_TIMING_PROMPT_CH0      #language en-US "tRCD Channel 0: "#string STR_TRCD_TIMING_HELP_CH0        #language en-US "Shows tRCD configuration in channel 0"#string STR_TRCD_TIMING_VALUE_CH0       #language en-US "N/A" // Dynamically updated#string STR_TRP_TIMING_PROMPT_CH0       #language en-US "tRP  Channel 0: "#string STR_TRP_TIMING_HELP_CH0         #language en-US "Shows tRP configuration in channel 0"#string STR_TRP_TIMING_VALUE_CH0        #language en-US "N/A" // Dynamically updated#string STR_TRAS_TIMING_PROMPT_CH0      #language en-US "tRAS Channel 0: "#string STR_TRAS_TIMING_HELP_CH0        #language en-US "Shows tRAS configuration in channel 0"#string STR_TRAS_TIMING_VALUE_CH0       #language en-US "N/A" // Dynamically updated#string STR_TCL_TIMING_PROMPT_CH1       #language en-US "tCL  Channel 1: "#string STR_TCL_TIMING_HELP_CH1         #language en-US "Shows tCL configuration in channel 1"#string STR_TCL_TIMING_VALUE_CH1        #language en-US "N/A" // Dynamically updated#string STR_TRCD_TIMING_PROMPT_CH1      #language en-US "tRCD Channel 1: "#string STR_TRCD_TIMING_HELP_CH1        #language en-US "Shows tRCD configuration in channel 1"#string STR_TRCD_TIMING_VALUE_CH1       #language en-US "N/A" // Dynamically updated#string STR_TRP_TIMING_PROMPT_CH1       #language en-US "tRP  Channel 1: "#string STR_TRP_TIMING_HELP_CH1         #language en-US "Shows tRP configuration in channel 1"#string STR_TRP_TIMING_VALUE_CH1        #language en-US "N/A" // Dynamically updated#string STR_TRAS_TIMING_PROMPT_CH1      #language en-US "tRAS Channel 1: "#string STR_TRAS_TIMING_HELP_CH1        #language en-US "Shows tRAS configuration in channel 1"#string STR_TRAS_TIMING_VALUE_CH1       #language en-US "N/A" // Dynamically updated#string STR_TCL_TIMING_PROMPT           #language en-US "tCL"#string STR_TCL_TIMING_HELP             #language en-US "Set tCL  to Auto | 7 -> 18, 20 DRAM Clocks"#string STR_TRCD_TIMING_PROMPT          #language en-US "tRCD"#string STR_TRCD_TIMING_HELP            #language en-US "Set tRCD to Auto | 7 -> 18, 20 DRAM Clocks"#string STR_TRP_TIMING_PROMPT           #language en-US "tRP"#string STR_TRP_TIMING_HELP             #language en-US "Set tRP  to Auto | 7 -> 18, 20 DRAM Clocks"#string STR_TRAS_TIMING_PROMPT          #language en-US "tRAS"#string STR_TRAS_TIMING_HELP            #language en-US "Set tRAS to Auto | 24 -> 44 DRAM clocks"#string STR_TRTP_TIMING_PROMPT          #language en-US "tRTP"#string STR_TRTP_TIMING_HELP            #language en-US "Set tRTP to Auto | 6 -> 10 DRAM clocks"#string STR_TRRD_TIMING_PROMPT          #language en-US "tRRD"#string STR_TRRD_TIMING_HELP            #language en-US "Set tRRD to Auto | 4 -> 10 DRAM clocks"#string STR_CMD_RATE_PROMPT             #language en-US "Command Mode"#string STR_CMD_RATE_HELP               #language en-US "Set tCMD to Default, 1N or 2N"#string STR_TFAW_TIMING_PROMPT          #language en-US "tFAW"#string STR_TFAW_TIMING_HELP            #language en-US "Set tFAW to Auto | 16 | 20 | 22 | 23 | 24 | 26 | 27 | 30 | 32 | 33 DRAM clocks"#string STR_TCCD_TIMING_PROMPT          #language en-US "tCCD"#string STR_TCCD_TIMING_HELP            #language en-US "Set tCCD to Auto | 4 -> 8 DRAM clocks"#string STR_TWTP_TIMING_PROMPT          #language en-US "tWTP"#string STR_TWTP_TIMING_HELP            #language en-US "Set tWTP to Auto / 15 / 16 / 17 / 18 / 19 / 20 / 21 / 22 / 23 / 24 / 25 / 26 / 27 / 28 / 29 / 30 DRAM clocks"#string STR_TWCL_TIMING_PROMPT          #language en-US "tWCL"#string STR_TWCL_TIMING_HELP            #language en-US "Set tWCL  to Auto | 7 -> 12, 14, 16, 18 DRAM clocks"#string STR_PERFORMANCE_STRING            #language en-US "Performance"#string STR_POWER_STRING                  #language en-US "Power Savings"#string STR_CUSTOM_STRING                 #language en-US "Custom"//// Memory configuration option//#string STR_REFRESH_RATE_PROMPT         #language en-US "Select Refresh Rate"#string STR_REFRESH_RATE_HELP           #language en-US "Disable, 1x, 2x or 4x options available"#string STR_REFRESH_RATE_1X             #language en-US " 1x"#string STR_REFRESH_RATE_1X_2X          #language en-US " 1x/2X"#string STR_REFRESH_RATE_2X_4X          #language en-US " 2x/4x"#string STR_REFRESH_RATE_1X_2X_4X       #language en-US " 1X/2X/4X"#string STR_REFRESH_RATE_2X             #language en-US " 2x "#string STR_REFRESH_RATE_4X             #language en-US " 4x "#string STR_REFRESH_WATERMARK_PROMPT      #language en-US "Refresh Watermark"#string STR_REFRESH_WATERMARK_HELP        #language en-US "Sets refresh watermark levels."#string STR_REFRESH_WATERMARK_HIGH_STRING #language en-US "High WM"#string STR_REFRESH_WATERMARK_LOW_STRING  #language en-US "Low WM"#string STR_BDEBUG_SELF_REFRESH_PROMPT  #language en-US "BDebug1 DRAM Self Refresh"#string STR_BDEBUG_SELF_REFRESH_HELP    #language en-US "Enable/Disable DRAM Self Refresh During C0"#string STR_DRAM_RAPL_TIME_WINDOW_SUPPORT   #language en-US "RAPL Time Window"#string STR_DRAM_RAPL_TIME_WINDOW_HELP      #language en-US "DRAM RAPL Time Window for PL1"#string STR_DRAM_RAPL_POWER_LIMIT_EN_SUPPORT   #language en-US "RAPL Power Limit Enable"#string STR_DRAM_RAPL_POWER_LIMIT_EN_HELP      #language en-US "DRAM RAPL Power Limit[1] Enable for DDR Domain"#string STR_DRAM_RAPL_POWER_LIMIT_SUPPORT   #language en-US "RAPL Power Limit"#string STR_DRAM_RAPL_POWER_LIMIT_HELP      #language en-US "DRAM RAPL Power Limit[1] for DDR Domain specified in mWatts"#string STR_PMOP_PC0_PROMPT             #language en-US "PMOP Value for PC0"#string STR_PMOP_PC0_HELP               #language en-US "Power Mode Opcode for PC0"         #string STR_PMOP_PCX_PROMPT             #language en-US "PMOP Value for PCX"  #string STR_PMOP_PCX_HELP               #language en-US "Power Mode Opcode for PCX"         #string STR_PER_BIT_MARGINS_PROMPT      #language en-US "Per-Bit Margins"#string STR_PER_BIT_MARGINS_HELP        #language en-US "Enable to show per-bit margins in MRC training"#string STR_MEMORY_THERMAL_PROMPT       #language en-US "Memory Thermal Throttling"#string STR_MEMORY_THERMAL_PROMPT_HELP  #language en-US "Enable/Disable Memory Thermal Throttling Management mode"#string STR_THERMAL_THROTTLING_TYPE_PROMPT       #language en-US "   Thermal Throttling Type"#string STR_THERMAL_THROTTLING_TYPE_PROMPT_HELP  #language en-US "Select CLTT/OLTT mode"#string STR_CLTT_STRING                          #language en-US "CLTT"#string STR_OLTT_STRING                          #language en-US "OLTT"#string STR_CLTT_MODE_PROMPT                     #language en-US "   CLTT Mode"#string STR_CLTT_MODE_PROMPT_HELP                #language en-US "Select CLTT Normal/Passthru mode"#string STR_CLTT_NORMAL_STRING                   #language en-US "Normal"#string STR_CLTT_PASSTHRU_STRING                 #language en-US "Passthru"#string STR_TEMP_HI_PROMPT                   #language en-US "   High Temperature"#string STR_TEMP_HI_HELP                     #language en-US "Set temperature level from 105C to 255C"#string STR_TEMP_MID_PROMPT                  #language en-US "   Medium Temperature"#string STR_TEMP_MID_HELP                    #language en-US "Set temperature level from 85C to 104C"#string STR_TEMP_LO_PROMPT                   #language en-US "   Low Temperature"#string STR_TEMP_LO_HELP                     #language en-US "Set temperature level from 0C to 84C"#string STR_THRT_CRIT_PROMPT                 #language en-US "   Critical BW Level"#string STR_THRT_CRIT_HELP                   #language en-US "Set Bandwidth level from 0% to 9%"#string STR_THRT_HI_PROMPT                   #language en-US "   High BW Level"#string STR_THRT_HI_HELP                     #language en-US "Set Bandwidth level from 10% to 50%"#string STR_THRT_MID_PROMPT                  #language en-US "   Medium BW Level"#string STR_THRT_MID_HELP                    #language en-US "Set Bandwidth level from 51% to 100%"#string STR_OLTT_THRT_BW_PROMPT              #language en-US "   OLTT Throttle BW"#string STR_OLTT_THRT_BW_HELP                #language en-US "Set OLTT Throttle Bandwidth from 0% to 100%"#string STR_MEMHOT_PROMPT                    #language en-US "MEMHOT Level"#string STR_MEMHOT_PROMPT_HELP               #language en-US "MEMHOT disabled (no response to pin assertion), Mid Level, Hi Level, Critical Level (MEMHOT re-uses CLTT THRT MID/HI/CRIT registers or OLTT BW Level)"#string STR_MEMHOT_THRT_MID_STRING           #language en-US "Mid"#string STR_MEMHOT_THRT_HI_STRING            #language en-US "Hi"#string STR_MEMHOT_THRT_CRIT_STRING          #language en-US "Critical"#string STR_EN_MEMTRIP_PROMPT                #language en-US "MEMTRIP"#string STR_EN_MEMTRIP_HELP                  #language en-US "Enable\Disable MEMTRIP"#string STR_TEMP_MEMTRIP_PROMPT              #language en-US "   MEMTRIP Temperature"#string STR_TEMP_MEMTRIP_HELP                #language en-US "Temperature at which mem trip will be asserted"#string STR_OPEN_PAGE_POLICY_PROMPT     #language en-US "Open Page Policy Timer"#string STR_OPEN_PAGE_POLICY_HELP       #language en-US "Set Page Closure Timer to Disabled / Immediate / 30-60 ns / 60-120ns / 120-240ns / 240-480ns / 480-960ns / 1-2us"#string STR_OVERRIDE_CHECKPOINT_PROMPT  #language en-US "Override Checkpoints"#string STR_OVERRIDE_CHECKPOINT_HELP    #language en-US "Set to Auto (normal function)/Enabled(Adds a breakpoint if warm-reset can't be executed)/Disabled"#string STR_CMD_RATE_VALUE_1N           #language en-US " 1N "#string STR_CMD_RATE_VALUE_2N           #language en-US " 2N "#string STR_CMD_RATE_VALUE_3N           #language en-US " 3N "#string STR_OOO_MEMORY_PROCESSING_PROMPT  #language en-US "Out of order memory processing"#string STR_OOO_MEMORY_PROCESSING_HELP    #language en-US "Enables out of order memory processing, improving performance"#string STR_TWO_CLOCK_RD_PREAMBLE_PROMPT  #language en-US "Read Two Clock Preamble"#string STR_TWO_CLOCK_RD_PREAMBLE_HELP    #language en-US "Enables Two Clock Preamble for Reads"#string STR_TWO_CLOCK_WR_PREAMBLE_PROMPT  #language en-US "Write Two Clock Preamble"#string STR_TWO_CLOCK_WR_PREAMBLE_HELP    #language en-US "Enables Two Clock Preamble for Writes"#string STR_WR_DATA_ENABLE_PROMPT  #language en-US "Write Data Early Enable"#string STR_WR_DATA_ENABLE_HELP    #language en-US "Enables Write Data Early"#string STR_RX_SKEW_CONTROL_PROMPT  #language en-US "Rx Skew Control"#string STR_RX_SKEW_CONTROL_HELP    #language en-US "Selects Rx Skew Control 0: No skew, 1: +2, 2: -2 ticks"#string STR_PERFORMANCE_PROFILE_PROMPT #language en-US "Performance Profile"#string STR_PERFORMANCE_PROFILE_HELP   #language en-US "Performance profile for DMAP"#string STR_PROFILE_ONE_STRING         #language en-US "17_19_13_18"#string STR_PROFILE_TWO_STRING         #language en-US "17_19_6_18"#string STR_PROFILE_THREE_STRING       #language en-US "17_19_6_7"#string STR_TX_SKEW_CONTROL_PROMPT  #language en-US "Tx Skew Control"#string STR_TX_SKEW_CONTROL_HELP    #language en-US "Selects Tx Skew Control 0: No skew, 1: +2, 2: -2 ticks"#string STR_NO_SKEW_STRING    #language en-US "No Skew"#string STR_PLUS_TWO_STRING   #language en-US "+2 Ticks"#string STR_MINUS_TWO_STRING  #language en-US "-2 Ticks"#string STR_OOO_AGING_THRESHOLD_PROMPT    #language en-US "Out of order aging threshold"#string STR_OOO_AGING_THRESHOLD_HELP      #language en-US "Specifies the number of requests that can be processed ahead of another request sitting in the In-Progress request queue before OOO is disabled"#string STR_NEW_REQUEST_BYPASS_PROMPT     #language en-US "New request bypass"#string STR_NEW_REQUEST_BYPASS_HELP       #language en-US "Enables new memory requests to be processed immediately, skipping the In-Progress queue, if the queue is empty"#string STR_OPEN_PAGE_POLICY_30TO60NS       #language en-US " 30-60 ns "#string STR_OPEN_PAGE_POLICY_60TO120NS      #language en-US " 60-120 ns "#string STR_OPEN_PAGE_POLICY_120TO240NS     #language en-US " 120-240 ns "#string STR_OPEN_PAGE_POLICY_240TO480NS     #language en-US " 240-480 ns "#string STR_OPEN_PAGE_POLICY_480TO960NS     #language en-US " 480-960 ns "#string STR_OPEN_PAGE_POLICY_1TO2MS         #language en-US " 1-2 us "#string STR_SCRAMBLER_PROMPT        #language en-US "Scrambler "#string STR_SCRAMBLER_HELP          #language en-US "Enable / Disable the scrambler "#string STR_SLOW_POWER_DOWN_EXIT_PROMPT #language en-US "Slow Power Down Exit "#string STR_SLOW_POWER_DOWN_EXIT_HELP   #language en-US "Enable / Disable Slow Power Down Exit from pre-charge"//// IMR Setup//#string STR_IMR0_PROMPT           #language en-US "IMR 0"#string STR_IMR1_PROMPT           #language en-US "IMR 1"#string STR_IMR2_PROMPT           #language en-US "IMR 2"#string STR_IMR3_PROMPT           #language en-US "IMR 3"#string STR_IMR4_PROMPT           #language en-US "IMR 4"#string STR_IMR5_PROMPT           #language en-US "IMR 5"#string STR_IMR6_PROMPT           #language en-US "IMR 6"#string STR_IMR7_PROMPT           #language en-US "IMR 7"#string STR_IMR0_HELP             #language en-US "Setup for Isolate Memory Region 0 "#string STR_IMR1_HELP             #language en-US "Setup for Isolate Memory Region 1 (SMM/TSEG)"#string STR_IMR2_HELP             #language en-US "Setup for Isolate Memory Region 2 (P Code)"#string STR_IMR3_HELP             #language en-US "Setup for Isolate Memory Region 3 "#string STR_IMR4_HELP             #language en-US "Setup for Isolate Memory Region 4 "#string STR_IMR5_HELP             #language en-US "Setup for Isolate Memory Region 5 "#string STR_IMR6_HELP             #language en-US "Setup for Isolate Memory Region 6 "#string STR_IMR7_HELP             #language en-US "Setup for Isolate Memory Region 7 "#string STR_TSEG_REGION           #language en-US " SMM/TSEG Region "#string STR_PUNIT_REGION          #language en-US " Punit Region "//// ADR/C2F feature//#string STR_ADR_C2F_PROMPT        #language en-US "ADR/C2F"#string STR_ADR_C2F_HELP          #language en-US "Support for ADR/C2F features"#string STR_ADR_ONLY_STRING       #language en-US "ADR-Only "#string STR_SWC2F_STRING          #language en-US "SWC2F "#string STR_ADR_C2F_STRING        #language en-US "ADR-C2F "#string STR_ADR_CH1_PROMPT        #language en-US "Battery Back Channel 1"#string STR_ADR_CH1_HELP          #language en-US "Controls if Channel 1 will be battery backed"#string STR_MIN_TYPE0_PROMPT	  #language en-US "Min Type 0"#string STR_MIN_TYPE0_HELP		  #language en-US "Min Amount of Memory to\n report as e820 Type 0"//// Video Devices//#string STR_VIDEO_TITLE_IDENT       #language en-US  "  Video Setup"#string STR_VIDEO_TITLE             #language en-US  "Video Setup"#string STR_VIDEO_HELP              #language en-US  "Controls the configuration of Graphics Display Devices."#string STR_PCIE_ASPM_EN_PROMPT     #language en-US  "ASPM Support"#string STR_PCIE_ASPM_EN_HELP       #language en-US  "Enable PCI Express Active State Power Management settings."#string STR_PCIE_ASPM_PROMPT        #language en-US  "Automatic ASPM"#string STR_PCIE_ASPM_HELP          #language en-US  "Automatically enable ASPM based on reported capabilities and known issues."#string STR_MRC_TRAINING_MSG_SUPPORT        #language en-US "MRC Debug Messages"#string STR_MRC_TRAINING_MSG_HELP           #language en-US "Enable to display debug output in MRC"#string STR_MEMTEST_LOOP_SUPPORT            #language en-US "Memory Test Loop"#string STR_MEMTEST_LOOP_SUPPORT_HELP       #language en-US "Enable to repeat memory test infinitely"#string STR_HALT_SYSTEM_ON_MEMTEST_ERROR_SUPPORT #language en-US "Halt on Memtest Fail"#string STR_HALT_SYSTEM_ON_MEMTEST_SUPPORT_HELP  #language en-US "Enable to halt the system if an error is observed during memory test"#string STR_HALT_ON_CPGC_ERROR_SUPPORT      #language en-US "Halt on CPGC Error"#string STR_HALT_ON_CPGC_ERROR_SUPPORT_HELP #language en-US "Enable to halt the CPGC on the first error it encounters during memory test"#string STR_RESET_LOOP_SUPPORT              #language en-US "MRC Reset Test"#string STR_RESET_LOOP_SUPPORT_HELP         #language en-US "Enable to execute MRC Reset Test a defined number of cycles"#string STR_MRC_RESET_LOOP_CYCLES_PROMPT    #language en-US "   Test Cycles"#string STR_MRC_RESET_LOOP_CYCLES_HELP      #language en-US "Defines the number of cycles for MRC Reset Test"#string STR_ECC_SUPPORT             #language en-US "ECC Support"#string STR_ECC_SUPPORT_HELP        #language en-US "Select to enable/disable ECC Support"#string STR_FINE_DDR_VOLTAGE_SUPPORT        #language en-US "Fine Ddr Voltage"#string STR_FINE_DDR_VOLTAGE_SUPPORT_HELP   #language en-US "Select between -100 to 100 mV in steps of 5mv. 0 -> -100mV :: 100 -> 0mV :: 200 -> 100mV"#string STR_PATROL_SUPPORT          #language en-US "Patrol Scrub Enable"#string STR_PATROL_SUPPORT_HELP     #language en-US "Select to enable/disable Patrol Scrub Support"#string STR_FAULTY_PART_SUPPORT       #language en-US "Faulty Part Tracking"#string STR_FAULTY_PART_SUPPORT_HELP  #language en-US "Select to enable/disable faulty part tracking"#string STR_FAULTY_PART_ONCORRECTABLE #language en-US "On Correctable Faulty Part"#string STR_FAULTY_PART_ONCORRECTABLE_HELP #language en-US "On Correctable Faulty DIMM issue (single bit) halt or continue"#string STR_SCRUB_SUPPORT           #language en-US "Demand Scrub Enable"#string STR_SCRUB_SUPPORT_HELP      #language en-US "Select to enable/disable Demand Scrub Support"#string STR_PATROL_PERIOD          #language en-US "Patrol Scrub Period"#string STR_PATROL_PERIOD_HELP     #language en-US "Select the Patrol Scrub Period"#string STR_PATROL_PERIOD_1        #language en-US "1 hour"#string STR_PATROL_PERIOD_4        #language en-US "4 hours"#string STR_PATROL_PERIOD_10       #language en-US "10 hours"#string STR_PATROL_PERIOD_24       #language en-US "24 hours"#string STR_MAX_SCRUB_DEBIT_COUNT_PROMPT    #language en-US "Max Scrub Debit Count"#string STR_MAX_SCRUB_DEBIT_COUNT_HELP      #language en-US "Maximum Number of debit Patrol scrub operations"#string STR_SEND_BOOT_VECTOR_TO_DRAM_SUPPORT        #language en-US "Send Boot Vector to DRAM"#string STR_SEND_BOOT_VECTOR_TO_DRAM_SUPPORT_HELP   #language en-US "When this bit is set, accesses to BIOS1, BIOS2, BIOS3 and BIOS4 ranges will be sent to memory regardless of the Host IO Boundary setting in TOLUD"#string STR_AB_SEG_TO_DRAM_SUPPORT          #language en-US "AB Segments in DRAM"#string STR_AB_SEG_TO_DRAM_SUPPORT_HELP     #language en-US "When this bit is set reads and writes targeting AorB-segments are routed to DRAM"#string STR_E_SEG_TO_DRAM_SUPPORT           #language en-US "E Segment in DRAM"#string STR_E_SEG_TO_DRAM_SUPPORT_HELP      #language en-US "When this bit is set reads and writes targeting E segment are routed to DRAM"#string STR_F_SEG_TO_DRAM_SUPPORT           #language en-US "F Segment in DRAM"#string STR_F_SEG_TO_DRAM_SUPPORT_HELP      #language en-US "When this bit is set reads and writes targeting F segment are routed to DRAM"#string STR_ZQC_ENABLE_SUPPORT              #language en-US "ZQ Calibration"#string STR_ZQC_ENABLE_SUPPORT_HELP         #language en-US "Enables ZQ Calibration."#string STR_BRAM_PARITY_ENABLE_SUPPORT      #language en-US "BRAM Parity"#string STR_BRAM_PARITY_ENABLE_SUPPORT_HELP #language en-US "Enables MC Error reporting for BRAM parity errors.  'Auto' applies the safest setting for the stepping."#string STR_RMT_SUPPORT            #language en-US "Rank Margin Tool"#string STR_RMT_SUPPORT_HELP       #language en-US "Enable Rank Margin Tool support"#string STR_MEMORY_PRESERVATION_SUPPORT            #language en-US "Memory Preservation"#string STR_MEMORY_PRESERVATION_SUPPORT_HELP       #language en-US "Enables memory content preservation thru Warm Reset"#string STR_CPGC_LOOP_COUNT        #language en-US "Training CPGC exp_loop_cnt"#string STR_RMT_CPGC_LOOP_COUNT    #language en-US "RMT CPGC exp_loop_cnt"#string STR_CPGC_LOOP_COUNT_HELP   #language en-US "Set the CPGC exp_loop_cnt field for MRC trainings 2^(exp_loop_cnt -1)"#string STR_RMT_CPGC_LOOP_COUNT_HELP   #language en-US "Set the CPGC exp_loop_cnt field for RMT execution 2^(exp_loop_cnt -1)"#string STR_CPGC_LOOP_COUNT_1      #language en-US "1"#string STR_CPGC_LOOP_COUNT_2      #language en-US "2"#string STR_CPGC_LOOP_COUNT_3      #language en-US "3"#string STR_CPGC_LOOP_COUNT_4      #language en-US "4"#string STR_CPGC_LOOP_COUNT_5      #language en-US "5"#string STR_CPGC_LOOP_COUNT_6      #language en-US "6"#string STR_CPGC_LOOP_COUNT_7      #language en-US "7"#string STR_CPGC_LOOP_COUNT_8      #language en-US "8"#string STR_CPGC_LOOP_COUNT_9      #language en-US "9"#string STR_CPGC_LOOP_COUNT_10      #language en-US "10"#string STR_CPGC_LOOP_COUNT_11      #language en-US "11"#string STR_CPGC_LOOP_COUNT_12      #language en-US "12"#string STR_CPGC_LOOP_COUNT_13      #language en-US "13"#string STR_CPGC_LOOP_COUNT_14      #language en-US "14"#string STR_CPGC_LOOP_COUNT_15      #language en-US "15"#string STR_CPGC_NUM_BURSTS          #language en-US "Training CPGC num_bursts"#string STR_CPGC_NUM_BURSTS_HELP     #language en-US "Set the CPGC num_bursts field for MRC trainings 2^(num_bursts -1)"#string STR_RMT_CPGC_NUM_BURSTS      #language en-US "RMT CPGC num_bursts"#string STR_RMT_CPGC_NUM_BURSTS_HELP #language en-US "Set the CPGC num_bursts field for RMT execution 2^(num_bursts -1)"#string STR_MRC_FAST_BOOT           #language en-US "Fast Boot"#string STR_MRC_FAST_BOOT_HELP      #language en-US "Enables/Disables fast boot which skips memory training and attempts to boot using last known good configuration."#string STR_MESEG_ENABLE            #language en-US "MeSeg Enable"#string STR_MESEG_HELP              #language en-US "Enables Memory for Manageability Engine Usage"#string STR_MMIO_SIZE               #language en-US "MMIO Size / BMBOUND Base"#string STR_MMIO_SIZE_HELP          #language en-US "Size of memory mapped IO space / Corresponding BMBOUND Base setting. BMBound base plus Memory map IO low will always be 4GB"#string STR_BMBOUND_BASE            #language en-US "BMBOUND Base"#string STR_BMBOUND_BASE_HELP       #language en-US "Address of BMBOUND register"#string STR_BMBOUNDHI_BASE          #language en-US "BMBOUNDHI Base"#string STR_BMBOUNDHI_BASE_HELP     #language en-US "Address of BMBOUNDHI register"#string STR_MEMORY_AUTO             #language en-US "Auto"#string STR_MEMORY_1024M            #language en-US "1024M / 3072M"#string STR_MEMORY_2048M            #language en-US "2048M / 2048M"#string STR_MEMORY_3072M            #language en-US "3072M / 1024M"#string STR_SSA_CONFIG_PROMPT               #language en-US "SSA Config"#string STR_SSA_CONFIG_HELP                 #language en-US "SSA Config"#string STR_DFX_SSA_CONFIG_PROMPT           #language en-US "DFX SSA Config"#string STR_DFX_SSA_CONFIG_HELP             #language en-US "DFX SSA Config"#string STR_SSA_CLOCK_GATING                #language en-US "SSA Clock Gating"#string STR_SSA_CLOCK_GATING_HELP           #language en-US "Enable SSA Clock Gating on NorthBridge"#string STR_IN_ORDER_APIC                   #language en-US "In Order APIC"#string STR_IN_ORDER_APIC_HELP              #language en-US "Enable/Disable In Order APIC. Option applies to B0 Stepping ONLY."#string STR_SCHEDULER_LATENCY               #language en-US "Scheduler Lat"#string STR_SCHEDULER_LATENCY_HELP          #language en-US "Scheduler Latency. Value programmed has 250ns resolution."#string STR_SA_VTD_PROMPT                   #language en-US "VT-d"//G160-004(6)   #string STR_SA_VTD_HELP                     #language en-US "COption to Enable / Disable VT-d"//G160-004(6) - start#string STR_SA_VTD_HELP                     #language en-US "Option to Enable / Disable VT-d"//G160-004(6) - end#string STR_SA_VTD_IR_PROMPT                   #language en-US "VT-d Interrupt remapping"#string STR_SA_VTD_IR_HELP                     #language en-US "Option to Enable/Disable VT-d Interrupt remapping"#string STR_COS_CAT_AGENT0                  #language en-US "COS CAT Agent0"#string STR_COS_CAT_AGENT1                  #language en-US "COS CAT Agent1"#string STR_COS_CAT_AGENT2                  #language en-US "COS CAT Agent2"#string STR_COS_CAT_AGENT3                  #language en-US "COS CAT Agent3"#string STR_COS_CAT_AGENT4                  #language en-US "COS CAT Agent4"#string STR_COS_CAT_AGENT5                  #language en-US "COS CAT Agent5"#string STR_COS_CAT_AGENT6                  #language en-US "COS CAT Agent6"#string STR_COS_CAT_AGENT7                  #language en-US "COS CAT Agent7"#string STR_COS_CAT_AGENT8                  #language en-US "COS CAT Agent8"#string STR_COS_CAT_AGENT9                  #language en-US "COS CAT Agent9"#string STR_COS_CAT_AGENT10                 #language en-US "COS CAT Agent10"#string STR_COS_CAT_AGENT11                 #language en-US "COS CAT Agent11"#string STR_COS_CAT_AGENT12                 #language en-US "COS CAT Agent12"#string STR_COS_CAT_AGENT13                 #language en-US "COS CAT Agent13"#string STR_COS_CAT_AGENT14                 #language en-US "COS CAT Agent14"#string STR_COS_CAT_AGENT15                 #language en-US "COS CAT Agent15"#string STR_COS_CAT_AGENT_HELP              #language en-US "COS Category for Agent"#string STR_DFX_MEMORY_CONFIG_PROMPT               #language en-US "Memory Config DFX Menu"//// MSI redirection algorithm strings//#string STR_MSI_MSG_ALGORITHM               #language en-US "MSI algorithm"#string STR_MSI_MSG_HELP                 	  #language en-US "Allow change the MSI algorithm"#string STR_MSI_FIXED_PRIORITY              #language en-US "Fixed priority"#string STR_MSI_ROUND_ROBIN              	  #language en-US "Round Robin"#string STR_BEST_EFFORT_MAX_LATENCY         #language en-US "BestEffortMaxLat"#string STR_BEST_EFFORT_MAX_LATENCY_HELP    #language en-US "Best Effort Max Latency"#string STR_PAGE_HIT_DELAY                  #language en-US "PageHitDelay"#string STR_PAGE_HIT_DELAY_HELP             #language en-US "Page Hit Delay"#string STR_ISOC_BANK_PREFETCH              #language en-US "ISOCBankPref"#string STR_ISOC_BANK_PREFETCH_HELP         #language en-US "ISOC Bank Prefetch"#string STR_BEST_EFFORT_BANK_PREFETCH       #language en-US "BestEffortBankPref"#string STR_BEST_EFFORT_BANK_PREFETCH_HELP  #language en-US "Best Effort Bank Prefetch"#string STR_VREF_OVRD_ENABLE_PROMPT  #language en-US "Vref Override Enable"#string STR_VREF_OVRD_ENABLE_HELP    #language en-US "Enables/Disables Vref Override Enable"#string STR_VREF_OVRD_PROMPT         #language en-US "Vref Override Value"#string STR_VREF_OVRD_HELP           #language en-US "Selects Vref Override Value"#string STR_BWR_SMBUSLOCK1_SUPPORT   #language en-US "GBE Register"#string STR_CAPLOCK_SUPPORT_HELP     #language en-US "capabilities, next capability pointer, SSID/SVID, slot register, etc."#string STR_SATA2LOCK_SUPPORT        #language en-US "SATA2 Register"#string STR_SATA3LOCK_SUPPORT        #language en-US "SATA3 Register"#string STR_PCIE_ASPM_PROMPT         #language en-US "ASPM Support"#string STR_PCIE_ASPM_HELP           #language en-US "Set the ASPM Level: Force L0 - Force all links to L0 State : AUTO - BIOS auto configure : DISABLE - Disables ASPM"#string STR_FORCE_L0                 #language en-US "Force L0"#string STR_PCIE_EXTD_SYNCH_PROMPT   #language en-US "Extended Synch"#string STR_PCIE_EXTD_SYNCH_HELP     #language en-US "If ENABLED allows generation of Extended Synchronization patterns."#string STR_PCIE_EXTTAGFLD_PROMPT    #language en-US "Extended Tag"#string STR_PCIE_EXTTAGFLD_HELP      #language en-US "If ENABLED allows Device to use 8-bit TAG field as a requester."#string STR_RP_FORM	                 #language en-US "Root Port Status"#string STR_RP    	                 #language en-US "Root Port Status"#string STR_RP_HELP                  #language en-US "Root Port Status"#string STR_RP1                      #language en-US "Root Port 1"#string STR_RP2                      #language en-US "Root Port 2"#string STR_RP3                      #language en-US "Root Port 3"#string STR_RP4                      #language en-US "Root Port 4"#string STR_RP5                      #language en-US "Root Port 5"#string STR_RP6                      #language en-US "Root Port 6"#string STR_RP7                      #language en-US "Root Port 7"#string STR_RP8                      #language en-US "Root Port 8"#string STR_RP9                      #language en-US "Root Port 9"#string STR_RP10                     #language en-US "Root Port 10"#string STR_RP11                     #language en-US "Root Port 11"#string STR_RP12                     #language en-US "Root Port 12"//#string STR_DE_EMPHASYS_RP_PROMPT    #language en-US "Root Ports De-emphasis"#string STR_DE_EMPHASYS_RP1_PROMPT   #language en-US "RP1 De-emphasis"#string STR_DE_EMPHASYS_RP2_PROMPT   #language en-US "RP2 De-emphasis"#string STR_DE_EMPHASYS_RP3_PROMPT   #language en-US "RP3 De-emphasis"#string STR_DE_EMPHASYS_RP4_PROMPT   #language en-US "RP4 De-emphasis"#string STR_DE_EMPHASYS_RP5_PROMPT   #language en-US "RP5 De-emphasis"#string STR_DE_EMPHASYS_RP6_PROMPT   #language en-US "RP6 De-emphasis"#string STR_DE_EMPHASYS_RP7_PROMPT   #language en-US "RP7 De-emphasis"#string STR_DE_EMPHASYS_RP8_PROMPT   #language en-US "RP8 De-emphasis"#string STR_DE_EMPHASYS_HELP         #language en-US "Selectable De-emphasis (SD)"#string STR_DE_EMPHASYS_6_DB         #language en-US  "  -6 dB"#string STR_DE_EMPHASYS_35_DB        #language en-US "  -3.5 dB"#string STR_PCI_FORM                 #language en-US "PCI Subsystem Settings"#string STR_PCIE_DEV                 #language en-US "PCI Express Device Settings"#string STR_PCI_DFX_FORM             #language en-US "PCI DFX Subsystem Settings"#string STR_MEM_BANK_XOR_PROMPT      #language en-US "Bank XOR Mapping" #string STR_MEM_BANK_XOR_HELP        #language en-US "Memory Bank XOR Mapping" #string STR_MEM_BANK_XOR_ENABLED     #language en-US "Enabled" #string SRT_MEM_BANK_XOR_DISABLED    #language en-US "Disabled" #string STR_BAR_PLACEMENT_FORM       #language en-US "Set Root Ports BAR "#string STR_BAR_PLACEMENT_HELP       #language en-US "select Addr 2 exp N "//// SA:RestrictedBegin//#string STR_MEMORY_TAGEC_PROMPT      #language en-US "TAGEC"#string STR_MEMORY_TAGEC_HELP        #language en-US "Reserve TAGEC Memory Space"//// SA:RestrictedEnd////// End of file//